config.org
* Window Management
** Global Bindings
#+BEGIN_SRC emacs-lisp
  (defvar *my-global-keybindings* nil
    "A list of user-defined global keybindings.")

  (defun make-global-keybindings (key-pairs)
    "KEY-PAIRS are of the form (string symbol) where STRING contains the key combination and SYMBOL is the function to call."
    (append (mapcar (lambda (x)
                      (list 'global-set-key (list 'kbd (car x)) (cadr x)))
                    key-pairs)
            (mapcar (lambda (x)
                      (list 'push-new-global-keybinding `',x))
                    key-pairs)))

  (defun push-new-global-keybinding (key-pair)
    (unless (member key-pair *my-global-keybindings*)
      (push key-pair *my-global-keybindings*)))

  (defmacro def-global-keys (&rest key-pairs)
    "Expand a series of (str sym) -> (global-set-key (kbd str) sym)."
    `(progn ,@(make-global-keybindings key-pairs)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (def-global-keys
    ("C-x O" 'mode-line-other-buffer)
    ("s-a" 'org-agenda)
    ;; Rebinding these to Ctrl-r and Ctrl-R since swiper is bound to Ctrl-s.
    ("C-r" 'isearch-forward)
    ("C-S-R" 'isearch-backward)
    ("<s-return>" 'ansi-term)
    ("C-x b" 'ibuffer)
    ("C-x C-b" 'ido-switch-buffer)
    ("C-c s-e" 'config-visit)
    ("C-c s-r" 'config-reload)
    ("C-c s-s" 'stumpwm-config)
    ("C-x 2" 'split-and-follow-horizontally)
    ("C-x 3" 'split-and-follow-vertically)
    ("C-c w w" 'kill-whole-word)
    ("C-c w l" 'copy-whole-line)
    ("C-x k" 'kill-current-buffer)
    ("C-M-s-k" 'kill-all-buffers))
#+END_SRC

** Enable Ido Mode
#+BEGIN_SRC emacs-lisp
  (setq
   ido-enable-flex-matching nil
   ido-create-new-buffer 'always
   ido-everywhere t)
  (ido-mode t)

  ;; vertical ido
  ;; ido-vertical-mode from the package destroys C-h f performance in conjunction with ido-ubiquitous-mode
  ;; so we use our own ido-vertical
  ;; taken from the wiki page
  (setq ido-decorations (quote ("\n-> " "" "\n   " "\n   ..." "[" "]" " [No match]" " [Matched]" " [Not readable]" " [Too big]" " [Confirm]")))
  (defun ido-disable-line-truncation () (set (make-local-variable 'truncate-lines) nil))
  (add-hook 'ido-minibuffer-setup-hook 'ido-disable-line-truncation)
  (defun ido-define-keys () ;; C-n/p is more intuitive in vertical layout
    (define-key ido-completion-map (kbd "C-n") 'ido-next-match)
    (define-key ido-completion-map (kbd "C-p") 'ido-prev-match))
  (add-hook 'ido-setup-hook 'ido-define-keys)
#+END_SRC
** Window Splitting & Following
#+BEGIN_SRC emacs-lisp
  (defun split-and-follow-horizontally ()
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))
  (defun split-and-follow-vertically ()
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))

  (add-to-list 'display-buffer-alist
               '("*Apropos*" display-buffer-same-window))
  (add-to-list 'display-buffer-alist
               '("*Help*" display-buffer-same-window))
#+END_SRC
** Buffers
*** Always kill current buffer
#+BEGIN_SRC emacs-lisp
  (defun kill-current-buffer ()
    (interactive)
    (kill-buffer (current-buffer)))
#+END_SRC
*** Kill all buffers
#+BEGIN_SRC emacs-lisp
  (defun kill-all-buffers ()
    (interactive)
    (mapc 'kill-buffer (buffer-list)))
#+END_SRC
* General QoL
** Mark
#+BEGIN_SRC emacs-lisp
  (defun save-position ()
    (interactive)
    (push-mark))

  (global-set-key (kbd "s-x") 'save-position)
#+END_SRC
** Calendar
#+BEGIN_SRC emacs-lisp
  (setq calendar-latitude 33.46)
  (setq calendar-longitude -118.11)
#+END_SRC
** Mark-line
#+BEGIN_SRC emacs-lisp
  (defun mark-line ()
    (interactive)
    (move-beginning-of-line nil)
    (set-mark-command nil)
    (move-end-of-line nil))

  (defun comment-box-line ()
    (interactive "*r\np")
    (mark-line)
    (comment-box))
#+END_SRC
** Info
#+BEGIN_SRC emacs-lisp
  ;; Center screen on menu item when moving up.
  (advice-add 'Info-up :after 'recenter)
#+END_SRC
** Spelling
#+BEGIN_SRC emacs-lisp
  ;; (add-hook 'LaTeX-mode-hook 'flyspell-mode)
  ;; (add-hook 'org-mode-hook 'flyspell-mode)
  (global-set-key (kbd "<f8>") 'flyspell-mode)
#+END_SRC
** Initial Buffer
#+BEGIN_SRC emacs-lisp
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+END_SRC
** Environment
#+BEGIN_SRC emacs-lisp
  (unless (getenv "THEME")
    (setenv "THEME" "solarized-light"))
#+END_SRC
** Languages
*** Lisp
#+BEGIN_SRC emacs-lisp
  ;; (setq inferior-lisp-program "sbcl")
#+END_SRC
*** C/C++
#+BEGIN_SRC emacs-lisp
  ;; (add-hook 'c++-mode-hook 'irony-mode)
  ;; (add-hook 'c-mode-hook 'irony-mode)
  (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)
  (add-hook 'irony-mode-hook 'irony-eldoc)
#+END_SRC
** Compile
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c s-c") 'compile)
#+END_SRC
** Tabs and spaces
#+BEGIN_SRC emacs-lisp
  (setq-default c-basic-offset 4
                tab-width 4
                indent-tabs-mode nil
                c-default-style "k&r"
                python-indent 4
                python-guess-indent nil)
  ;(setq tab-width 4
  ;      indent-tabs-mode t
  ;      c-default-style "k&r")

  ;; For some reason the above doesn't work for python...
  (custom-set-variables
   '(tab-width 4))

  ;(defvaralias 'c-basic-offset 'tab-width)
#+END_SRC
** Convenient functions
*** kill-whole-word
#+BEGIN_SRC emacs-lisp
  (defun kill-whole-word ()
    (interactive)
    (forward-char)
    (backward-word)
    (kill-word 1))
#+END_SRC
*** copy-whole-line
#+BEGIN_SRC emacs-lisp
  (defun copy-whole-line ()
    (interactive)
    (save-excursion
      (kill-new
       (buffer-substring
        (point-at-bol)
        (point-at-eol)))))
#+END_SRC
** Syntax
*** subword (for camelCase navigation)
#+BEGIN_SRC emacs-lisp
  (global-subword-mode 1)
#+END_SRC
*** electric
For auto-closing parentheses, etc.
#+BEGIN_SRC emacs-lisp
  (setq electric-pair-pairs '(
                              (?\( . ?\))
                              (?\[ . ?\])
                              (?\{ . ?\})
                              ))
  ;;(electric-pair-mode t)
#+END_SRC
*** show parens
#+BEGIN_SRC emacs-lisp
  (show-paren-mode t)
#+END_SRC
** Files
*** Autosave (Disabled)
#+BEGIN_SRC emacs-lisp
  (setq auto-save-default nil)
#+END_SRC
*** Backups (Use ~/.saves/)
#+BEGIN_SRC emacs-lisp
  (setq
    backup-by-copying t                           ; us cp to backup files
    backup-directory-alist '(("." . "~/.saves"))  ; stop fs clutter
    delete-old-versions t
    kept-new-versions 6
    kept-old-versions 2
    version-control t)
#+END_SRC
** Skip Emacs Startup Message
#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-message t)
#+END_SRC
** Show lines and columns on modeline
#+BEGIN_SRC emacs-lisp
  (line-number-mode 1)
  (column-number-mode 1)
#+END_SRC
** Confirm w/ y or n
#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC
** Visual
*** GUI Tweaks
#+BEGIN_SRC emacs-lisp
  (when window-system (global-hl-line-mode t))

  ;; (when window-system (global-prettify-symbols-mode t))
  ;; (global-prettify-symbols-mode t)
  ;; (global-pretty-mode t)

  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
#+END_SRC
*** Relative Line Numbers
#+BEGIN_SRC emacs-lisp
  (use-package linum-relative
    :ensure t
    :config
    (setq linum-relative-current-symbol "")
    (add-hook 'prog-mode-hook 'linum-relative-mode))
#+END_SRC
** Sounds
#+BEGIN_SRC emacs-lisp
  (setq ring-bell-function 'ignore)
#+END_SRC
** Scroll Gradually
#+BEGIN_SRC emacs-lisp
  (setq scroll-conservatively 100)
#+END_SRC
** Config
*** Edit
#+BEGIN_SRC emacs-lisp
  (defun config-visit ()
    (interactive)
    (find-file "~/.emacs.d/config.org"))

  (defun stumpwm-config ()
    (interactive)
    (find-file "~/.stumpwm.d/init.lisp"))
#+END_SRC
*** Reload
#+BEGIN_SRC emacs-lisp
  (defun config-reload ()
    (interactive)
    (org-babel-load-file (expand-file-name "~/.emacs.d/config.org")))
#+END_SRC
** Clock
#+BEGIN_SRC emacs-lisp
  (setq display-time-24hr-format t)
  (display-time-mode 1)
#+END_SRC
* Packages (Active)
** 
#+BEGIN_SRC emacs-lisp
  ;; (use-package sml-mode
  ;;   :ensure t)
#+END_SRC
** auctex
#+BEGIN_SRC emacs-lisp
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  ;; (setq-default TeX-master nil) ; prompt for master file, useful for multi-documents
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
  (setq reftex-plug-into-AUCTeX t)
  (setq TeX-electric-sub-and-superscript t)
  (add-hook 'LaTeX-mode-hook 'visual-line-mode)
  (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
  (setq TeX-PDF-mode t)

  ;; see https://superuser.com/a/902764
  ;; (TeX-global-PDF-mode t)
  (setq latex-run-command "pdflatex")
#+END_SRC
** mingus
#+BEGIN_SRC emacs-lisp
  (use-package mingus
    :ensure t
    :config
    ;; (add-to-list 'ivy-completing-read-handlers-alist '(mingus-query . nil))
    :bind
    ("s-m b" . mingus-browse)
    ("s-m p" . mingus))
#+END_SRC
