config.el
(defvar *my-global-keybindings* nil
  "A list of user-defined global keybindings.")

(defun make-global-keybindings (key-pairs)
  "KEY-PAIRS are of the form (string symbol) where STRING contains the key combination and SYMBOL is the function to call."
  (append (mapcar (lambda (x)
                    (list 'global-set-key (list 'kbd (car x)) (cadr x)))
                  key-pairs)
          (mapcar (lambda (x)
                    (list 'push-new-global-keybinding `',x))
                  key-pairs)))

(defun push-new-global-keybinding (key-pair)
  (unless (member key-pair *my-global-keybindings*)
    (push key-pair *my-global-keybindings*)))

(defmacro def-global-keys (&rest key-pairs)
  "Expand a series of (str sym) -> (global-set-key (kbd str) sym)."
  `(progn ,@(make-global-keybindings key-pairs)))

(def-global-keys
  ("C-x O" 'mode-line-other-buffer)
  ("s-a" 'org-agenda)
  ;; Rebinding these to Ctrl-r and Ctrl-R since swiper is bound to Ctrl-s.
  ("C-r" 'isearch-forward)
  ("C-S-R" 'isearch-backward)
  ("<s-return>" 'ansi-term)
  ("C-x b" 'ibuffer)
  ("C-x C-b" 'ido-switch-buffer)
  ("C-c s-e" 'config-visit)
  ("C-c s-r" 'config-reload)
  ("C-c s-s" 'stumpwm-config)
  ("C-x 2" 'split-and-follow-horizontally)
  ("C-x 3" 'split-and-follow-vertically)
  ("C-c w w" 'kill-whole-word)
  ("C-c w l" 'copy-whole-line)
  ("C-x k" 'kill-current-buffer)
  ("C-M-s-k" 'kill-all-buffers))

(setq
 ido-enable-flex-matching nil
 ido-create-new-buffer 'always
 ido-everywhere t)
(ido-mode t)

;; vertical ido
;; ido-vertical-mode from the package destroys C-h f performance in conjunction with ido-ubiquitous-mode
;; so we use our own ido-vertical
;; taken from the wiki page
(setq ido-decorations (quote ("\n-> " "" "\n   " "\n   ..." "[" "]" " [No match]" " [Matched]" " [Not readable]" " [Too big]" " [Confirm]")))
(defun ido-disable-line-truncation () (set (make-local-variable 'truncate-lines) nil))
(add-hook 'ido-minibuffer-setup-hook 'ido-disable-line-truncation)
(defun ido-define-keys () ;; C-n/p is more intuitive in vertical layout
  (define-key ido-completion-map (kbd "C-n") 'ido-next-match)
  (define-key ido-completion-map (kbd "C-p") 'ido-prev-match))
(add-hook 'ido-setup-hook 'ido-define-keys)

(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))
(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))

(add-to-list 'display-buffer-alist
             '("*Apropos*" display-buffer-same-window))
(add-to-list 'display-buffer-alist
             '("*Help*" display-buffer-same-window))

(defun kill-current-buffer ()
  (interactive)
  (kill-buffer (current-buffer)))

(defun kill-all-buffers ()
  (interactive)
  (mapc 'kill-buffer (buffer-list)))

(defun mark-line ()
  (interactive)
  (move-beginning-of-line nil)
  (set-mark-command nil)
  (move-end-of-line nil))

(defun comment-box-line ()
  (interactive "*r\np")
  (mark-line)
  (comment-box))

;; Center screen on menu item when moving up.
(advice-add 'Info-up :after 'recenter)

;; (add-hook 'LaTeX-mode-hook 'flyspell-mode)
;; (add-hook 'org-mode-hook 'flyspell-mode)
(global-set-key (kbd "<f8>") 'flyspell-mode)

(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))

(unless (getenv "THEME")
  (setenv "THEME" "solarized-light"))

(setq inferior-lisp-program "/usr/bin/sbcl")

(add-hook 'c++-mode-hook 'irony-mode)
(add-hook 'c-mode-hook 'irony-mode)
(add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)
(add-hook 'irony-mode-hook 'irony-eldoc)

(global-set-key (kbd "C-c s-c") 'compile)

(setq-default c-basic-offset 4
              tab-width 4
              indent-tabs-mode nil
              c-default-style "k&r")
;(setq tab-width 4
;      indent-tabs-mode t
;      c-default-style "k&r")

;(defvaralias 'c-basic-offset 'tab-width)

(defun kill-whole-word ()
  (interactive)
  (forward-char)
  (backward-word)
  (kill-word 1))

(defun copy-whole-line ()
  (interactive)
  (save-excursion
    (kill-new
     (buffer-substring
      (point-at-bol)
      (point-at-eol)))))

(global-subword-mode 1)

(setq electric-pair-pairs '(
                            (?\( . ?\))
                            (?\[ . ?\])
                            (?\{ . ?\})
                            ))
;;(electric-pair-mode t)

(show-paren-mode t)

(setq auto-save-default nil)

(setq
  backup-by-copying t                           ; us cp to backup files
  backup-directory-alist '(("." . "~/.saves"))  ; stop fs clutter
  delete-old-versions t
  kept-new-versions 6
  kept-old-versions 2
  version-control t)

(setq inhibit-startup-message t)

(line-number-mode 1)
(column-number-mode 1)

(defalias 'yes-or-no-p 'y-or-n-p)

(when window-system (global-hl-line-mode t))

;; (when window-system (global-prettify-symbols-mode t))
;; (global-prettify-symbols-mode t)
;; (global-pretty-mode t)

(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)

(use-package linum-relative
  :ensure t
  :config
  (setq linum-relative-current-symbol "")
  (add-hook 'prog-mode-hook 'linum-relative-mode))

(setq ring-bell-function 'ignore)

(setq scroll-conservatively 100)

(defun config-visit ()
  (interactive)
  (find-file "~/.emacs.d/config.org"))

(defun stumpwm-config ()
  (interactive)
  (find-file "~/.stumpwm.d/init.lisp"))

(defun config-reload ()
  (interactive)
  (org-babel-load-file (expand-file-name "~/.emacs.d/config.org")))

(setq display-time-24hr-format t)
(display-time-mode 1)

(setq TeX-auto-save t)
(setq TeX-parse-self t)
;; (setq-default TeX-master nil) ; prompt for master file, useful for multi-documents
(add-hook 'LaTeX-mode-hook 'turn-on-reftex)
(setq reftex-plug-into-AUCTeX t)
(setq TeX-electric-sub-and-superscript t)
(add-hook 'LaTeX-mode-hook 'visual-line-mode)
(add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
(setq TeX-PDF-mode t)

;; see https://superuser.com/a/902764
;; (TeX-global-PDF-mode t)
(setq latex-run-command "pdflatex")

(use-package mingus
  :ensure t
  :config
  ;; (add-to-list 'ivy-completing-read-handlers-alist '(mingus-query . nil))
  :bind
  ("s-m b" . mingus-browse)
  ("s-m p" . mingus))
