config.org
** emms
#+BEGIN_SRC emacs-lisp
  (use-package emms
    :ensure t
    :config
      (require 'emms-setup)
      (require 'emms-player-mpd)
      (emms-all) ; don't change this to values you see on stackoverflow questions if you expect emms to work
      (setq emms-seek-seconds 5)
      (setq emms-player-list '(emms-player-mpd))
      (setq emms-info-functions '(emms-info-mpd))
      (setq emms-player-mpd-server-name "localhost")
      (setq emms-player-mpd-server-port "6600"))
      ;; ("s-m r" . emms-player-mpd-update-all-reset-cache)
  (setq mpc-host "localhost:6600")

  (defun mpd/update-database ()
    "Updates the MPD database synchronously."
    (interactive)
    (call-process "mpc" nil nil nil "update")
    (message "MPD Database Updated!"))
  (global-set-key (kbd "s-m u") 'mpd/update-database)
#+END_SRC
** paredit
#+BEGIN_SRC emacs-lisp
  (use-package paredit
    :ensure t
    :config
    (add-hook 'lisp-mode-hook 'paredit-mode)
    (add-hook 'scheme-mode-hook 'paredit-mode)
    (add-hook 'emacs-lisp-mode-hook 'paredit-mode))

  (defun no-space-between-@-open-paren (endp delimiter)
    (not (and (eql ?\( delimiter)
              (eql ?\@ (char-before (point))))))

  (setq paredit-space-for-delimiter-predicates
        '(no-space-between-@-open-paren))
#+END_SRC
** dmenu
#+BEGIN_SRC emacs-lisp
  (use-package dmenu
    :ensure t
    :bind
    ("s-SPC" . 'dmenu))
#+END_SRC
** smart-tabs
#+BEGIN_SRC emacs-lisp
  (use-package smart-tabs-mode
    :ensure t
    :init
    (setq smart-tabs-mode nil)
    :config
    (smart-tabs-insinuate 'c 'c++ 'python))
#+END_SRC
** ido-completig-read+
#+BEGIN_SRC emacs-lisp
  (use-package ido-completing-read+
    :ensure t
    :config
    (ido-ubiquitous-mode 1))
#+END_SRC
** geiser
*Note*: Installing with use-package causes problems for me...
The geiser commands will work immediately after installing but once I restart emacs they break. Attempting to start a geiser REPL at this point will throw an error: "required feature 'geiser-guile' was not provided".
Just directly installing with melpa package-install seems to be working for now...
** easy-kill
#+BEGIN_SRC emacs-lisp
  (use-package easy-kill
    :ensure t
    :config (global-set-key [remap kill-ring-save] 'easy-kill))
#+END_SRC
** expand-region
#+BEGIN_SRC emacs-lisp
  (use-package expand-region
    :ensure t
    :bind ("C-=" . 'er/expand-region))
#+END_SRC
** multiple-cursors
#+BEGIN_SRC emacs-lisp
    (use-package multiple-cursors
      :ensure t
      :bind
      ("s-q" . mc/mark-next-like-this)
      ("s-Q" . mc/unmark-next-like-this))
#+END_SRC
** flycheck
#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    :ensure t
    :config
    (add-hook 'prog-mode-hook 'flycheck-mode)
    (with-eval-after-load 'flycheck
      (setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc)))) ; stop annoying "add comments!" warnings
#+END_SRC
** stumpwm-mode
#+BEGIN_SRC emacs-lisp
  (use-package stumpwm-mode
    :ensure t)
#+END_SRC
** magit
#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t)
#+END_SRC
** which-key
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure t
    :init
    (which-key-mode))
#+END_SRC
** beacon
#+BEGIN_SRC emacs-lisp
  (use-package beacon
    :ensure t
    :init
    (beacon-mode 1))
#+END_SRC
** smex
#+BEGIN_SRC emacs-lisp
  (use-package smex
    :ensure t
    :init (smex-initialize)
    :bind
    ("M-x" . smex))
#+END_SRC
** org-bullets
#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))
#+END_SRC
** avy
#+BEGIN_SRC emacs-lisp
  (use-package avy
    :ensure t
    :init
    (setq avy-background t)
    :bind
    ("s-f" . avy-goto-word-1)
    ("s-F" . avy-goto-char))
#+END_SRC
** rainbow
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-mode
    :ensure t
    :init (add-hook 'prog-mode-hook 'rainbow-mode))
#+END_SRC
#+BEGIN_SRC emacs-lisp
  ;; (use-package rainbow-delimiters
  ;;   :ensure t
  ;;   :init
  ;;   (rainbow-delimiters-mode t)
  ;;   (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
  ;;   (add-hook 'geiser-repl-mode 'rainbow-delimiters-mode))
#+END_SRC
** sudo-edit
#+BEGIN_SRC emacs-lisp
  (use-package sudo-edit
    :ensure t)
#+END_SRC
** dashboard
#+BEGIN_SRC emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook)
    (setq
     dashboard-items '((recents . 7)
                       (projects . 7))
     dashboard-banner-logo-title "Welcome to Emacs"))
#+END_SRC
** company
#+BEGIN_SRC emacs-lisp
  (use-package company
    :ensure t
    :config
    (setq company-idle-delay 0)
    :init
    (add-hook 'prog-mode-hook 'company-mode))

  (with-eval-after-load 'company
      (define-key company-active-map (kbd "M-n") nil)
      (define-key company-active-map (kbd "M-p") nil)
      (define-key company-active-map (kbd "C-n") #'company-select-next)
      (define-key company-active-map (kbd "C-p") #'company-select-previous))
#+END_SRC
** modeline
*** powerline
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package powerline
    :ensure t
    :init
    (powerline-default-theme))
#+END_SRC
*** diminish
#+BEGIN_SRC emacs-lisp
  (use-package diminish
    :ensure t
    :init
    (mapc 'diminish
          '(auto-revert-mode
            beacon-mode
            which-key-mode
            subword-mode
            rainbow-mode
            linum-relative-mode
            visual-line-mode
            global-guix-prettify-mode
            guix-prettify-mode
            org-indent-mode
            paredit-mode
            org-indent-mode
            eldoc-mode)))
#+END_SRC
** symon
#+BEGIN_SRC emacs-lisp
  (use-package symon
    :ensure t
    :bind
    ("s-i" . symon-mode))
#+END_SRC
** popup-kill-ring
#+BEGIN_SRC emacs-lisp
  (use-package popup-kill-ring
    :ensure t
    :bind
    ("M-y" . popup-kill-ring))
#+END_SRC
** swiper
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package swiper
    :ensure t
    :bind
    ("C-s" . swiper))
#+END_SRC
** projectile
#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :ensure t
    :init
    (projectile-mode 1))
#+END_SRC
* Packages (Unused)
** spaceline
#+BEGIN_SRC emacs-lisp
  ;; (use-package spaceline
  ;;   :ensure t
  ;;   :config
  ;;   (require 'spaceline-config)
  ;;   (setq powerline-default-separator (quote arrow))
  ;;   (spaceline-spacemacs-theme))
#+END_SRC

** slime
I'll probably install with quicklisp in the future.
#+BEGIN_SRC emacs-lisp
  ;; (use-package slime
    ;; :ensure t)
#+END_SRC
This package is annoying me at the moment when typing in the REPL so I've disabled it.
#+BEGIN_SRC emacs-lisp
  ;; (use-package slime-company
    ;; :ensure t)

  ;; (slime-setup '(slime-company))
#+END_SRC
** guix
#+BEGIN_SRC emacs-lisp
  (use-package guix
    :ensure t
    :config
    (setq global-guix-prettify-mode t))
#+END_SRC
** hungry-delete
Note: there is a package called hungry-delete that will automatically
delete whitespace until it finds a non-whitespace character when
you press backspace...
** ido-vertical
#+BEGIN_SRC emacs-lisp
  ;; (use-package ido-vertical-mode ; disabled b/c of performance with ido-ubiquitous
  ;;   :ensure t
  ;;   :init
  ;;   (ido-vertical-mode 0)) 
  ;; (setq ido-vertical-define-keys 'C-n-and-C-p-only)
#+END_SRC
** treemacs
#+BEGIN_SRC emacs-lisp
  ;; (use-package treemacs ; not using this right now
  ;;   :ensure t
  ;;   :bind
  ;;   ("C-x \\" . 'treemacs-toggle))
#+END_SRC
** switch-window
#+BEGIN_SRC emacs-lisp
  (use-package switch-window ; don't need this now
    :ensure t
    :config
    (setq
     switch-window-input-style 'minibuffer
     switch-window-increase 4
     switch-window-threshold 2
     switch-window-shortcut-style 'qwerty
     switch-window-qwerty-shortcuts
     '("a" "s" "d" "f" "j" "k" "l"))
    :bind
    ([remap other-window] . switch-window))
#+END_SRC
* Terminal
** Set default shell: zsh
#+BEGIN_SRC emacs-lisp
  (defvar my-term-shell "/usr/bin/zsh")
  (defadvice ansi-term (before force-bash)
    (interactive (list my-term-shell)))
  (defadvice term (before force-bash)
    (interactive (list my-term-shell)))
  (ad-activate 'ansi-term)
  (ad-activate 'term)
#+END_SRC

* Org
** Publish
#+BEGIN_SRC emacs-lisp
  (require 'ox-publish)
  (setq org-publish-project-alist
        '(("website-notes"
           :base-directory "~/website/org/"
           :base-extension "org"
           :publishing-directory "~/website/html/"
           :recursive t
           :publishing-function org-html-publish-to-html
           :headline-levels 4
           :auto-preamble t)
          ("website-static"
           :base-directory "~/website/org/"
           :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|mp4"
           :publishing-directory "~/website/html/"
           :recursive t
           :publishing-function org-publish-attachment)
          ("website" :components ("website-notes" "website-static"))))
#+END_SRC
** Clock
#+BEGIN_SRC emacs-lisp
  (setq org-clock-persist 'history)
  (org-clock-persistence-insinuate)
#+END_SRC
** Code blocks
*** Edit code blocks in current window
#+BEGIN_SRC emacs-lisp
  (setq org-src-window-setup 'current-window)
#+END_SRC
*** Native syntax highlighting
#+BEGIN_SRC emacs-lisp
  (setq org-src-fontify-natively t)
#+END_SRC
*** Native tab behavior
For some reason this setting not only does nothing but also throws an error at launch that prevents the spacemacs theme from even loading...
#+BEGIN_SRC emacs-lisp
;  ( org-src-tab-acts-natively t)
#+END_SRC
*** Snippets
**** Lisp
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist
               '("l" "#+BEGIN_SRC lisp\n?\n#+END_SRC"))
#+END_SRC
**** emacs-lisp
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
#+END_SRC
**** scheme
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist
               '("sc" "#+BEGIN_SRC scheme\n?\n#+END_SRC"))
#+END_SRC
**** python
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist
               '("py" "#+BEGIN_SRC python\n?\n#+END_SRC"))
#+END_SRC
