config.el

(use-package emms
  :ensure t
  :config
    (require 'emms-setup)
    (require 'emms-player-mpd)
    (emms-all) ; don't change this to values you see on stackoverflow questions if you expect emms to work
    (setq emms-seek-seconds 5)
    (setq emms-player-list '(emms-player-mpd))
    (setq emms-info-functions '(emms-info-mpd))
    (setq emms-player-mpd-server-name "localhost")
    (setq emms-player-mpd-server-port "6600"))
    ;; ("s-m r" . emms-player-mpd-update-all-reset-cache)
(setq mpc-host "localhost:6600")

(defun mpd/update-database ()
  "Updates the MPD database synchronously."
  (interactive)
  (call-process "mpc" nil nil nil "update")
  (message "MPD Database Updated!"))
(global-set-key (kbd "s-m u") 'mpd/update-database)

(use-package paredit
  :ensure t
  :config
  (add-hook 'lisp-mode-hook 'paredit-mode)
  (add-hook 'scheme-mode-hook 'paredit-mode)
  (add-hook 'emacs-lisp-mode-hook 'paredit-mode))

(use-package dmenu
  :ensure t
  :bind
  ("s-SPC" . 'dmenu))

(use-package smart-tabs-mode
  :ensure t
  :init
  (setq smart-tabs-mode nil)
  :config
  (smart-tabs-insinuate 'c 'c++ 'python))

(use-package ido-completing-read+
  :ensure t
  :config
  (ido-ubiquitous-mode 1))

(use-package easy-kill
  :ensure t
  :config (global-set-key [remap kill-ring-save] 'easy-kill))

(use-package expand-region
  :ensure t
  :bind ("C-=" . 'er/expand-region))

(use-package multiple-cursors
  :ensure t
  :bind
  ("s-q" . mc/mark-next-like-this)
  ("s-Q" . mc/unmark-next-like-this))

(use-package flycheck
  :ensure t
  :config
  (add-hook 'prog-mode-hook 'flycheck-mode)
  (with-eval-after-load 'flycheck
    (setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc)))) ; stop annoying "add comments!" warnings

(use-package stumpwm-mode
  :ensure t)

(use-package magit
  :ensure t)

(use-package which-key
  :ensure t
  :init
  (which-key-mode))

(use-package beacon
  :ensure t
  :init
  (beacon-mode 1))

(use-package smex
  :ensure t
  :init (smex-initialize)
  :bind
  ("M-x" . smex))

(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))

(use-package avy
  :ensure t
  :init
  (setq avy-background t)
  :bind
  ("s-f" . avy-goto-word-1)
  ("s-F" . avy-goto-char))

(use-package rainbow-mode
  :ensure t
  :init (add-hook 'prog-mode-hook 'rainbow-mode))

;; (use-package rainbow-delimiters
;;   :ensure t
;;   :init
;;   (rainbow-delimiters-mode t)
;;   (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
;;   (add-hook 'geiser-repl-mode 'rainbow-delimiters-mode))

(use-package sudo-edit
  :ensure t)

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  (setq
   dashboard-items '((recents . 7)
                     (projects . 7))
   dashboard-banner-logo-title "Welcome to Emacs"))

(use-package company
  :ensure t
  :config
  (setq company-idle-delay 0)
  :init
  (add-hook 'prog-mode-hook 'company-mode))

(with-eval-after-load 'company
    (define-key company-active-map (kbd "M-n") nil)
    (define-key company-active-map (kbd "M-p") nil)
    (define-key company-active-map (kbd "C-n") #'company-select-next)
    (define-key company-active-map (kbd "C-p") #'company-select-previous))

(use-package powerline
  :ensure t
  :init
  (powerline-default-theme))

(use-package diminish
  :ensure t
  :init
  (mapc 'diminish
        '(auto-revert-mode
          beacon-mode
          which-key-mode
          subword-mode
          rainbow-mode
          linum-relative-mode
          visual-line-mode
          global-guix-prettify-mode
          guix-prettify-mode
          org-indent-mode
          paredit-mode
          org-indent-mode
          eldoc-mode)))

(use-package symon
  :ensure t
  :bind
  ("C-s-h" . symon-mode))

(use-package popup-kill-ring
  :ensure t
  :bind
  ("M-y" . popup-kill-ring))

(use-package swiper
  :ensure t
  :bind
  ("C-s" . swiper))

(use-package projectile
  :ensure t
  :init
  (projectile-mode 1))

;; (use-package spaceline
;;   :ensure t
;;   :config
;;   (require 'spaceline-config)
;;   (setq powerline-default-separator (quote arrow))
;;   (spaceline-spacemacs-theme))

;; (use-package slime
  ;; :ensure t)

;; (use-package slime-company
  ;; :ensure t)

;; (slime-setup '(slime-company))

(use-package guix
  :ensure t
  :config
  (setq global-guix-prettify-mode t))

;; (use-package ido-vertical-mode ; disabled b/c of performance with ido-ubiquitous
;;   :ensure t
;;   :init
;;   (ido-vertical-mode 0)) 
;; (setq ido-vertical-define-keys 'C-n-and-C-p-only)

;; (use-package treemacs ; not using this right now
;;   :ensure t
;;   :bind
;;   ("C-x \\" . 'treemacs-toggle))

(use-package switch-window ; don't need this now
  :ensure t
  :config
  (setq
   switch-window-input-style 'minibuffer
   switch-window-increase 4
   switch-window-threshold 2
   switch-window-shortcut-style 'qwerty
   switch-window-qwerty-shortcuts
   '("a" "s" "d" "f" "j" "k" "l"))
  :bind
  ([remap other-window] . switch-window))

(defvar my-term-shell "/usr/bin/zsh")
(defadvice ansi-term (before force-bash)
  (interactive (list my-term-shell)))
(defadvice term (before force-bash)
  (interactive (list my-term-shell)))
(ad-activate 'ansi-term)
(ad-activate 'term)

(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)

(setq org-src-window-setup 'current-window)

(setq org-src-fontify-natively t)

;  ( org-src-tab-acts-natively t)

(add-to-list 'org-structure-template-alist
             '("l" "#+BEGIN_SRC lisp\n?\n#+END_SRC"))

(add-to-list 'org-structure-template-alist
             '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))

(add-to-list 'org-structure-template-alist
             '("sc" "#+BEGIN_SRC scheme\n?\n#+END_SRC"))

(add-to-list 'org-structure-template-alist
             '("py" "#+BEGIN_SRC python\n?\n#+END_SRC"))

(add-to-list 'org-structure-template-alist
