config.el
             '("sh" "#+BEGIN_SRC sh\n?\n#+END_SRC"))

(add-to-list 'org-structure-template-alist
             '("cpp" "#+BEGIN_SRC cpp\n?\n#+END_SRC"))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((lisp . t)
   (python . t)
   (gnuplot . t)))
(defun my-org-confirm-babel-evaluate (lang body)
  (not (string= lang "lisp"))
  (not (string= lang "emacs-lisp")))  ; don't ask for listed languages
(setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate) ;; overwrite default

(add-hook 'org-mode-hook '(lambda () (visual-line-mode)))

(add-to-list 'org-agenda-files (expand-file-name "~/orgfiles"))

(add-hook 'org-mode-hook 'org-indent-mode)

(global-set-key (kbd "s-s") 'slime-selector)
(global-set-key (kbd "C-h H") 'slime-documentation-lookup)
;; (load (expand-file-name "/usr/lib/quicklisp/slime-helper.el"))
(add-to-list 'slime-contribs 'slime-fancy)
(add-to-list 'slime-contribs 'slime-banner)

;; For faster startup. SLIME manual 2.5.3.
(setq slime-lisp-implementations
      `((sbcl ("sbcl" "--core" ,(expand-file-name "~/.emacs.d/sbcl.core-for-slime")))))

;; Local HyperSpec copy. Use w3m.
(setq common-lisp-hyperspec-root (expand-file-name "~/.emacs.d/HyperSpec/"))
(setq slime-browse-url-browser-function 'w3m-browse-url)

;; Would like a cleaner way to do this, i.e. just wrap slime-hyperspec-lookup instead of making a copied definition...
(defun my-slime-hyperspec-lookup (symbol-name)
  "Identical to `slime-hyperspec-lookup' except we shadow `browse-url-browser-function'."
  (interactive (list (common-lisp-hyperspec-read-symbol-name
                      (slime-symbol-at-point))))
  (if slime-browse-url-browser-function
      (let ((browse-url-browser-function
             slime-browse-url-browser-function))
        (hyperspec-lookup symbol-name))
    (hyperspec-lookup symbol-name)))

(setq slime-documentation-lookup-function 'my-slime-hyperspec-lookup)

;; Chicken Scheme extension - broken
;; (add-to-list 'load-path (expand-file-name (directory-file-name "~/Builds/chicken-slime/swank-chicken/")))
;; (autoload 'chicken-slime "chicken-slime" "SWANK backend for Chicken" t)
;; (add-hook 'scheme-mode-hook 'slime-mode)

;; (eval-after-load 'tramp '(setenv "SHELL" "/bin/bash"))
(defvar tramp-shell-prompt-pattern-default "\\(?:^\\|\\)[^]#$%>\n]*#?[]#$%>] *\\(\\[[0-9;]*[a-zA-Z] *\\)*")
(setf tramp-shell-prompt-pattern "\\(?:^\\|\\)[^]#$%>\n]*#?[]#$%>].* *\\(\\[[0-9;]*[a-zA-Z] *\\)*")

(add-to-list 'auto-mode-alist '("\\.pl$" . prolog-mode))
;; (define-key 'prolog-mode-map (kbd "C-x C-e") 'ediprolog-dwim)

(setq prolog-electric-if-then-else-flag t)
